[
    "Kiteverse is a new language. And the playground where you write it. Be the first to write it. Why kite? Because inspiration comes from above, and a kite takes us there. Why verse? Because the word is our ground. Kiteverse is above and below uniting in conversation.",
    "We are the energy that delivered The Outpost magazine and the force that sustained it for seven years through trials and triumphs. The Outpost was a magazine of possibilities that made waves when it launched from Beirut in 2012.",
    "Better writing: connects people. makes the rain rain and the spring spring. knows when to start and how to stop. dances on the limits of language. leaves a trace on your face. bends and blossoms. will not miss the beat.",
    "Our icon and visual identity were designed by MOONI Studio.",
    "In the past few years, more and more of us became interested in writing. Probably because writing connects us with ourselves and with one another. And many more of us are seeking that kind of connection. Our app is not just a response to this trend, but an attempt to revolutionize it. Be the first to join in revolution.",
    "We mean it when we say that our app is like no other. It was designed to train your pen to write better. But it is also a game, which will make the training way more fun, so you would want to come back to it and do more of it. Because in the process of coming back and doing more is the promise of mastery.",
    "1. You will be testing a revolutionary new app and giving us firsthand feedback. (So we can make it even better.) You will be offered a free seat in our first writing workshop, which will be hosted online in 2024. And your name will forever be etched in our code.",
    "Words have a transformative power. They can mend your heart and change your mind. They can dream up whole new worlds and will them into being. They are what movements are made of. They hold the keys to our liberation. And our future hangs on them. Now, what are you going to say? Kiteverse is your saying field.",
    "Kiteverse is a new writing-game that will make your writing better. This is our premise. And our promise. We are releasing the beta version in November 2023. Be the first to try it.",
    "Thanks for signing up to play Kiteverse. Look out for an email from us mid-November!"
]